Revit 2026 API
BoundaryConditions.GetCurve Method
 Returns curve that define geometry of the line boundary conditions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public Curve GetCurve()
Public Function GetCurve As Curve
public:
Curve^ GetCurve()
member GetCurve : unit -> Curve
Return Value
Curve
Exceptions
Exception | Condition
InvalidObjectException |  Thrown when BoundaryConditions is not a BoundaryConditionsType::Line type.
Remarks
 Boundary conditions should be BoundaryConditionsType::Line type. Otherwise exception is thrown.
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace